Revit 2027 API
AnalyticalMember.GetReleaseConditions Method
 Gets the release conditions associated with this Analytical Member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ReleaseConditions> GetReleaseConditions()
Public Function GetReleaseConditions As IList(Of ReleaseConditions)
public:
IList<ReleaseConditions^>^ GetReleaseConditions()
member GetReleaseConditions : unit -> IList<ReleaseConditions>
Return Value
IList<ReleaseConditions>
 Returns a collection of Release Conditions associated with this Analytical Member. Empty collection will be returned if Analytical Member doesn't have any Release Conditions. End to which release conditions will be added is defined by setting [!:Autodesk::Revit::DB::Structure::ReleaseConditions::Position] property in provided release conditions object.
See Also
Reference
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace